nxp-mcuxpresso/mcux-sdk/devices/LPC5536/drivers/fsl_power.c
    // Set LDO_EFUSE_PROG output voltage
    PMC->LDOEFUSEPROG = (PMC->LDOEFUSEPROG & (~PMC_LDOEFUSEPROG_VADJ_MASK)) | PMC_LDOEFUSEPROG_VADJ(V_LDO_1P850);

    // Configure the voltage level of LDO CORE Low Power mode (TODO :: :: Temporarily set to 0.9V; target is 0.8 V)*/
    PMC->LDOCORE0 = (PMC->LDOCORE0 & (~PMC_LDOCORE0_LPREGREFSEL_MASK)) | PMC_LDOCORE0_LPREGREFSEL(V_LDOCORE_LP_0P900);

    // SRAM uses Voltage Scaling in all Low Power modes
    PMC->SRAMCTRL = (PMC->SRAMCTRL & (~PMC_SRAMCTRL_SMB_MASK)) | PMC_SRAMCTRL_SMB(3);

    // Enable Analog References fast wake-up in case of wake-up from all low power modes and Hardware Pin reset
    PMC->REFFASTWKUP = PMC->REFFASTWKUP | PMC_REFFASTWKUP_LPWKUP_MASK | PMC_REFFASTWKUP_HWWKUP_MASK;

    // Enable FRO192MHz shut-off glitch suppression.
    // TODO ::  :: Check the Power Consumption Impact of this setting during DEEP-SLEEP and POWER-DOWN.
    //             (Supposed to be 1 to 2uA in typical conditions). If the impe
    //
    ANACTRL->OSC_TESTBUS = 0x1;

    return kPOWER_Status_Success;
}

/**
 * brief
 * return   power_status_t
 */
power_status_t POWER_SetCorePowerSource(power_core_pwr_source_t pwr_source)
{
    uint32_t pmc_reg_data;

    switch (pwr_source)
    {
        case kPOWER_CoreSrcDCDC:
        {
            // Enable DCDC (1st step)
            PMC->CMD = PMC_CMD_DCDCENABLE_MASK;

            // Wait until DCDC is enabled
            while ((PMC->STATUSPWR & PMC_STATUSPWR_DCDCPWROK_MASK) == 0UL)
            {
            }

            // Disable LDO Core Low Power Mode (2nd step)
            PMC->CMD = PMC_CMD_LDOCORELOWPWRDISABLE_MASK;

            // Disable LDO Core High Power Mode (3rd step)
            PMC->CMD = PMC_CMD_LDOCOREHIGHPWRDISABLE_MASK;

            // Check PMC Finite State Machines status
            pmc_reg_data = PMC->STATUS & (PMC_STATUS_FSMDCDCENABLE_MASK | PMC_STATUS_FSMLDOCOREHPENABLE_MASK |
                                          PMC_STATUS_FSMLDOCORELPENABLE_MASK | PMC_STATUS_FSMLDOCOREEXPTMRENABLE_MASK);
            if (pmc_reg_data != (PMC_STATUS_FSMDCDCENABLE_MASK | PMC_STATUS_FSMLDOCOREEXPTMRENABLE_MASK))
            {
                // Error : only DCDC and LDO CORE Exponential Timer must both be enabled.
                return (kPOWER_Status_Fail);
            }
        }
        break;

        case kPOWER_CoreSrcLDOCoreHP:
        {
            // Enable LDO Core High Power Mode (1st step)
            PMC->CMD = PMC_CMD_LDOCOREHIGHPWRENABLE_MASK;

            // Note: Once LDO_CORE High Power Mode has been enabled,
            // at least 2us are required before one can reliabily sample
            // the LDO Low Voltage Detectore Output.
            POWER_WaitLDOCoreInit();

            // Wait until LDO CORE High Power is enabled
            while ((PMC->STATUSPWR & PMC_STATUSPWR_LDOCOREPWROK_MASK) == 0UL)
            {
            }

            // Disable DCDC (2nd step)
            PMC->CMD = PMC_CMD_DCDCDISABLE_MASK;

            // Disable LDO Core Low Power Mode (3rd step)
            PMC->CMD = PMC_CMD_LDOCORELOWPWRDISABLE_MASK;

            // Check PMC Finite State Machines status
            pmc_reg_data = PMC->STATUS & (PMC_STATUS_FSMDCDCENABLE_MASK | PMC_STATUS_FSMLDOCOREHPENABLE_MASK |
                                          PMC_STATUS_FSMLDOCORELPENABLE_MASK | PMC_STATUS_FSMLDOCOREEXPTMRENABLE_MASK);
            if (pmc_reg_data != PMC_STATUS_FSMLDOCOREHPENABLE_MASK)
            {
                // Error : only LDO CORE High Power mode must both be enabled.
                return (kPOWER_Status_Fail);
            }
        }
        break;

        case kPOWER_CoreSrcLDOCoreLP:
        {
            // Enable LDO Core Low Power Mode (1st step)
            PMC->CMD = PMC_CMD_LDOCORELOWPWRENABLE_MASK;

            // Disable LDO Core High Power Mode (2nd step)
            PMC->CMD = PMC_CMD_LDOCOREHIGHPWRDISABLE_MASK;

            // Disable DCDC (3rd step)
            PMC->CMD = PMC_CMD_DCDCDISABLE_MASK;

            // Check PMC Finite State Machines status
            pmc_reg_data = PMC->STATUS & (PMC_STATUS_FSMDCDCENABLE_MASK | PMC_STATUS_FSMLDOCOREHPENABLE_MASK |
                                          PMC_STATUS_FSMLDOCORELPENABLE_MASK | PMC_STATUS_FSMLDOCOREEXPTMRENABLE_MASK);
            if (pmc_reg_data != (PMC_STATUS_FSMLDOCORELPENABLE_MASK | PMC_STATUS_FSMLDOCOREEXPTMRENABLE_MASK))
            {
                // Error : only LDO CORE Low Power mode and LDO CORE Exponential Timer must both be enabled.
                return (kPOWER_Status_Fail);
            }
        }
        break;

        case kPOWER_CoreSrcExternal:
        {
            // Disable LDO Core Low Power Mode (1st step)
            PMC->CMD = PMC_CMD_LDOCORELOWPWRDISABLE_MASK;

            // Disable LDO Core High Power Mode (2nd step)
            PMC->CMD = PMC_CMD_LDOCOREHIGHPWRDISABLE_MASK;

            // Disable DCDC (3rd step)
            PMC->CMD = PMC_CMD_DCDCDISABLE_MASK;

            // Check PMC Finite State Machines status
            pmc_reg_data = PMC->STATUS & (PMC_STATUS_FSMDCDCENABLE_MASK | PMC_STATUS_FSMLDOCOREHPENABLE_MASK |
                                          PMC_STATUS_FSMLDOCORELPENABLE_MASK | PMC_STATUS_FSMLDOCOREEXPTMRENABLE_MASK);
            if (pmc_reg_data != 0UL)
            {
                // Error :  All power sources must be disabled.
                return (kPOWER_Status_Fail);
            }
        }
        break;

        default: // Not supported
            return (kPOWER_Status_Fail);

    } // End switch (pwr_source)

    return (kPOWER_Status_Success);
}

/**
 * brief
 * @param   :
 * return   power_core_pwr_source_t
 */
power_core_pwr_source_t POWER_GetCorePowerSource(void)
{
    uint32_t reg_status, reg_statuspwr;

    reg_status    = PMC->STATUS;
    reg_statuspwr = PMC->STATUSPWR;

    if ((0UL != (reg_statuspwr & PMC_STATUSPWR_DCDCPWROK_MASK)) && (0UL != (reg_status & PMC_STATUS_FSMDCDCENABLE_MASK)))
    {
        /* DCDC */
        return (kPOWER_CoreSrcDCDC);
    }
    else
    {
        if ((0UL != (reg_statuspwr & PMC_STATUSPWR_LDOCOREPWROK_MASK)) && (0UL != (reg_status & PMC_STATUS_FSMLDOCOREHPENABLE_MASK)))
        {
            /* LDO_CORE High Power Mode */
            return (kPOWER_CoreSrcLDOCoreHP);
        }
        else
        {
            if (0UL != (reg_status & PMC_STATUS_FSMLDOCORELPENABLE_MASK))
            {
                /* LDO_CORE Low Power Mode */
                return (kPOWER_CoreSrcLDOCoreLP);
            }
            else
            {
                /* External */
                return (kPOWER_CoreSrcExternal);
            }
        }
    }
}

/**
 * brief
 * return   nothing
 */
power_status_t POWER_CorePowerSourceControl(power_core_pwr_source_t pwr_source, power_core_pwr_state_t pwr_state)
{
    switch (pwr_source)
    {
        case kPOWER_CoreSrcDCDC:
        {
            if (pwr_state == kPOWER_CorePwrEnable)
            {
                // Enable DCDC
                PMC->CMD = PMC_CMD_DCDCENABLE_MASK;

                // Wait until DCDC is enabled
                while ((PMC->STATUSPWR & PMC_STATUSPWR_DCDCPWROK_MASK) == 0UL)
                {
                }

                // Check PMC Finite State Machines status
                if ((PMC->STATUS & PMC_STATUS_FSMDCDCENABLE_MASK) == 0UL)
                {
                    // Error : DCDC not enabled.
                    return (kPOWER_Status_Fail);
                }
            }
            else
            {
                // Disable DCDC
                PMC->CMD = PMC_CMD_DCDCDISABLE_MASK;

                // Check PMC Finite State Machines status
                if ((PMC->STATUS & PMC_STATUS_FSMDCDCENABLE_MASK) != 0UL)
                {
                    // Error : DCDC is enabled.
                    return (kPOWER_Status_Fail);
                }
            }
        }
        break;

        case kPOWER_CoreSrcLDOCoreHP:
        {
            if (pwr_state == kPOWER_CorePwrEnable)
            {
                // Enable LDO Core High Power Mode
                PMC->CMD = PMC_CMD_LDOCOREHIGHPWRENABLE_MASK;

                // Note: Once LDO_CORE High Power Mode has been enabled,
                // at least 2us are required before one can reliabily sample
                // the LDO Low Voltage Detector Output.
                POWER_WaitLDOCoreInit();

                // Wait until LDO CORE High Power is enabled
                while ((PMC->STATUSPWR & PMC_STATUSPWR_LDOCOREPWROK_MASK) == 0UL)
                {
                }

                // Check PMC Finite State Machines status
                if ((PMC->STATUS & PMC_STATUS_FSMLDOCOREHPENABLE_MASK) == 0UL)
                {
                    // Error : LDO CORE High Power mode is not enabled.
                    return (kPOWER_Status_Fail);
                }
            }
            else
            {
                // Disable LDO Core High Power Mode
                PMC->CMD = PMC_CMD_LDOCOREHIGHPWRDISABLE_MASK;

                // Check PMC Finite State Machines status
                if ((PMC->STATUS & PMC_STATUS_FSMLDOCOREHPENABLE_MASK) != 0UL)
                {
                    // Error : LDO CORE High Power mode is enabled.
                    return (kPOWER_Status_Fail);
                }
            }
        }
        break;

        case kPOWER_CoreSrcLDOCoreLP:
        {
            if (pwr_state == kPOWER_CorePwrEnable)
            {
                // Enable LDO Core Low Power Mode (1st step)
                PMC->CMD = PMC_CMD_LDOCORELOWPWRENABLE_MASK;

                // Check PMC Finite State Machines status
                if ((PMC->STATUS & (PMC_STATUS_FSMLDOCORELPENABLE_MASK | PMC_STATUS_FSMLDOCOREEXPTMRENABLE_MASK)) !=
                    (PMC_STATUS_FSMLDOCORELPENABLE_MASK | PMC_STATUS_FSMLDOCOREEXPTMRENABLE_MASK))
                {
                    // Error : LDO CORE Low Power mode is not enabled.
                    return (kPOWER_Status_Fail);
                }
            }
            else
            {
                // Disable LDO Core Low Power Mode
                PMC->CMD = PMC_CMD_LDOCORELOWPWRDISABLE_MASK;

                // Check PMC Finite State Machines status
                if ((PMC->STATUS & (PMC_STATUS_FSMLDOCORELPENABLE_MASK | PMC_STATUS_FSMLDOCOREEXPTMRENABLE_MASK)) != 0UL)
                {
                    // Error : LDO CORE Low Power mode is enabled.
                    return (kPOWER_Status_Fail);
                }
            }
        }
        break;

        default: // Not supported
            return (kPOWER_Status_Fail);

    } // End switch (pwr_source)

