nxp-mcuxpresso/mcux-sdk/devices/LPC5536/drivers/fsl_power.c
    } // if ( reset_cause_reg & PMC_AOREG1_SYSTEMRESET_MASK )
}

/**
 * @brief             Described in fsl_common.h
 * @param
 * @return
 */
void POWER_SetVoltageForFreq(uint32_t system_freq_hz)
{
    if (system_freq_hz <= DCDC_POWER_PROFILE_LOW_MAX_FREQ_HZ)
    {
        /* [0 Hz - DCDC_POWER_PROFILE_LOW_MAX_FREQ_HZ Hz] */
        POWER_SetSystemPowerProfile(V_SYSTEM_POWER_PROFILE_LOW);
        POWER_SetVoltageForProcess(V_SYSTEM_POWER_PROFILE_LOW);
    }
    else
    {
        if (system_freq_hz <= DCDC_POWER_PROFILE_MEDIUM_MAX_FREQ_HZ)
        {
            /* ]DCDC_POWER_PROFILE_LOW_MAX_FREQ_HZ Hz - DCDC_POWER_PROFILE_MEDIUM_MAX_FREQ_HZ Hz] */
            POWER_SetSystemPowerProfile(V_SYSTEM_POWER_PROFILE_MEDIUM);
            POWER_SetVoltageForProcess(V_SYSTEM_POWER_PROFILE_MEDIUM);
        }
        else
        {
            /* > DCDC_POWER_PROFILE_MEDIUM_MAX_FREQ_HZ Hz */
            POWER_SetSystemPowerProfile(V_SYSTEM_POWER_PROFILE_HIGH);
            POWER_SetVoltageForProcess(V_SYSTEM_POWER_PROFILE_HIGH);
        }
    }

    /* Update BoD Core */
    if (0UL == Chip_GetVersion())
    {
        /* 0A */
        if (system_freq_hz <= 135000000U)
        {
            PMC->BODCORE = (PMC->BODCORE & ~PMC_BODCORE_HYST_MASK & ~PMC_BODCORE_TRIGLVL_MASK) |
                           PMC_BODCORE_HYST(kPOWER_BodHystLevel50mv) | PMC_BODCORE_TRIGLVL(kPOWER_BodCoreLevel0A900mv);
        }
        else
        {
            PMC->BODCORE = (PMC->BODCORE & ~PMC_BODCORE_HYST_MASK & ~PMC_BODCORE_TRIGLVL_MASK) |
                           PMC_BODCORE_HYST(kPOWER_BodHystLevel25mv) | PMC_BODCORE_TRIGLVL(kPOWER_BodCoreLevel0A950mv);
        }
    }
    else
    {
        /* 1B */
        if (system_freq_hz < 100000000U)
        {
            PMC->BODCORE = (PMC->BODCORE & ~PMC_BODCORE_HYST_MASK & ~PMC_BODCORE_TRIGLVL_MASK) |
                           PMC_BODCORE_HYST(kPOWER_BodHystLevel75mv) | PMC_BODCORE_TRIGLVL(kPOWER_BodCoreLevel1B929mv);
        }
        else if (system_freq_hz <= 135000000U)
        {
            PMC->BODCORE = (PMC->BODCORE & ~PMC_BODCORE_HYST_MASK & ~PMC_BODCORE_TRIGLVL_MASK) |
                           PMC_BODCORE_HYST(kPOWER_BodHystLevel50mv) | PMC_BODCORE_TRIGLVL(kPOWER_BodCoreLevel1B984mv);
        }
        else
        {
            PMC->BODCORE = (PMC->BODCORE & ~PMC_BODCORE_HYST_MASK & ~PMC_BODCORE_TRIGLVL_MASK) |
                           PMC_BODCORE_HYST(kPOWER_BodHystLevel25mv) | PMC_BODCORE_TRIGLVL(kPOWER_BodCoreLevel1B1038mv);
        }
    }
}

/**
 * @brief	Wait at least 2us.
 * @param	None
 * @return	Nothing
 */

static void POWER_WaitLDOCoreInit(void)
{
    /*
     * Note: Once LDO_CORE High Power Mode has been enabled,
     * at least 2us are required before one can reliabily sample
     * the LDO Low Voltage Detectore Output.
     * The PMC clock being 12 MHz, with at least 5 dummy read
     * operations, it is guaranteed by design that, whatever the
     * System/CPU clock frequency (up to 200 MHz).
     */

    volatile uint32_t reg_data;
    for (int i = 0; i < 5; i++)
    {
        reg_data = PMC->STATUSPWR; /* Dummy Read */
    }
    (void)reg_data;
}

/**
 * @brief	Wait at least 2us.
 * @param	None
 * @return	Nothing
 */

static void POWER_SRAMPowerUpDelay(void)
{
    /*
     * Note: Wait about 1 us
     * The PMC clock being 12 MHz, with at least 3 dummy read
     * operations, it is guaranteed by design that when this ,
     * function is called, at least 1 us will elapse,
     * whatever the System/CPU clock frequency (up to 200 MHz).
     */

    volatile uint32_t reg_data;
    for (int i = 0; i < 3; i++)
    {
        reg_data = PMC->STATUSPWR; /* Dummy Read */
    }
    (void)reg_data;
}

/**
 * @brief	Shut off the Flash and execute the _WFI(), then power up the Flash after wake-up event
 * @param	None
 * @return	Nothing
 */

static void POWER_PowerCycleCpu(void)
{
    /* Switch System Clock to FRO12Mhz (the configuration before calling this function will not be restored back) */
    POWER_SetSystemClock12MHZ();

    /* Configure the Cortex-M33 in Deep Sleep mode */
    SCB->SCR = SCB->SCR | SCB_SCR_SLEEPDEEP_Msk;

    /* Enter in low power mode */
    __WFI();

    /* Configure the Cortex-M33 in Active mode */
    SCB->SCR = SCB->SCR & (~SCB_SCR_SLEEPDEEP_Msk);
};

/**
 * @brief	Configures and enters in low power mode
 * @param	: p_lowpower_cfg
 * @return	Nothing
 */
static void POWER_SetLowPowerMode(LPC_LOWPOWER_T *p_lowpower_cfg)
{
    uint32_t i, primask, reg_data;
    uint32_t cpu0_nmi_enable;
    uint32_t cpu0_int_enable[4];
    uint32_t analog_ctrl_regs[7]; /* To store Analog Controller Registers */
    uint32_t vref_regs[4];        /* To store VREF Registers */
    uint32_t fmccr_reg;           /* FMC Configuration Register */

    /* Save FMC configuration */
    fmccr_reg = SYSCON->FMCCR;

    cpu0_nmi_enable = SYSCON->NMISRC & SYSCON_NMISRC_NMIENCPU0_MASK; /* Save the configuration of the NMI Register */
    SYSCON->NMISRC &= ~SYSCON_NMISRC_NMIENCPU0_MASK;                 /* Disable NMI of CPU0 */

    // Save the configuration of the CPU interrupt enable Registers (because they are overwritten in
    // POWER_SetLowPowerMode)
    for (i = 0; i < 4U; i++)
    {
        cpu0_int_enable[i] = NVIC->ISER[i];
    }

    uint32_t low_power_mode = (p_lowpower_cfg->CFG & LOWPOWER_CFG_LPMODE_MASK) >> LOWPOWER_CFG_LPMODE_INDEX;

    /* Set the Low power mode.*/
    PMC->CTRL = (PMC->CTRL & (~PMC_CTRL_LPMODE_MASK)) | PMC_CTRL_LPMODE(low_power_mode);

    /* SRAM in Retention modes */
    PMC->SRAMRETCTRL = p_lowpower_cfg->SRAMRETCTRL;

    /* Configure the voltage level of the Always On domain, Memories LDO */
    PMC->LDOPMU = (PMC->LDOPMU & (~PMC_LDOPMU_VADJ_PWD_MASK) & (~PMC_LDOPMU_VADJ_BOOST_PWD_MASK)) |
                  PMC_LDOPMU_VADJ_PWD((p_lowpower_cfg->VOLTAGE & LOWPOWER_VOLTAGE_LDO_PMU_MASK) >>
                                      LOWPOWER_VOLTAGE_LDO_PMU_INDEX) |
                  PMC_LDOPMU_VADJ_BOOST_PWD((p_lowpower_cfg->VOLTAGE & LOWPOWER_VOLTAGE_LDO_PMU_BOOST_MASK) >>
                                            LOWPOWER_VOLTAGE_LDO_PMU_BOOST_INDEX);

    PMC->LDOMEM = (PMC->LDOMEM & (~PMC_LDOMEM_VADJ_PWD_MASK) & (~PMC_LDOMEM_VADJ_BOOST_PWD_MASK)) |
                  PMC_LDOMEM_VADJ_PWD((p_lowpower_cfg->VOLTAGE & LOWPOWER_VOLTAGE_LDO_MEM_MASK) >>
                                      LOWPOWER_VOLTAGE_LDO_MEM_INDEX) |
                  PMC_LDOMEM_VADJ_BOOST_PWD((p_lowpower_cfg->VOLTAGE & LOWPOWER_VOLTAGE_LDO_MEM_BOOST_MASK) >>
                                            LOWPOWER_VOLTAGE_LDO_MEM_BOOST_INDEX);

