nxp-mcuxpresso/mcux-sdk/devices/LPC5536/drivers/fsl_power.c
    /*
     * Enable wake up interrupt.
     * Rational : we enable each interrupt (NVIC->ISER) that can wake up the CPU here (before the __disable_irq()
     * below): Hence, if an interrupt was pending and not treated before (for any reason), the CPU will jump to that
     *            interrupt handler before trying to enter the low power mode.
     *            VERY IMPORTANT : Also, any interrupt set in NVIC->ISER, even though __disable_irq(), will make the CPU
     *                             go out of the Deep Sleep mode.
     */
    for (i = 0; i < 4U; i++)
    {
        NVIC->ISER[i]      = p_lowpower_cfg->WAKEUPINT[i]; /* Enable wake-up interrupt */
        SYSCON->STARTER[i] = p_lowpower_cfg->WAKEUPSRC[i]; /* Enable wake-up sources */
    }

    /* Save the configuration of the Priority Mask Register */
    primask = __get_PRIMASK();

    switch (low_power_mode)
    {
        case LOWPOWER_CFG_LPMODE_DEEPSLEEP:
        {
            /* DEEP SLEEP power mode */

            uint32_t bod_core_trglvl; /* BoD Core trigger level */
            uint32_t css_ctrl, syscon_css_clk_ctrl, syscon_css_clk_pclk_hclk;
            uint32_t syscon_autoclkgateoverride_reg; /* AUTOCLKGATEOVERRIDE Configuration Register */

            /* Analog Modules to be shut off */
            PMC->PDSLEEPCFG0 = p_lowpower_cfg->PDCTRL[0];
            PMC->PDSLEEPCFG1 = p_lowpower_cfg->PDCTRL[1];

            /* Saving AUTOCLKGATEOVERRIDE register*/
            syscon_autoclkgateoverride_reg = SYSCON->AUTOCLKGATEOVERRIDE;

            /* DMA transactions with Flexcomm during DEEP SLEEP */
            SYSCON->HARDWARESLEEP = p_lowpower_cfg->HWWAKE;
            /* Enable autoclockgating on SDMA0 and SDMA1 during DeepSleep*/
            SYSCON->AUTOCLKGATEOVERRIDE =
                0xC0DE0000UL | (syscon_autoclkgateoverride_reg &
                              (~(SYSCON_AUTOCLKGATEOVERRIDE_SDMA1_MASK | SYSCON_AUTOCLKGATEOVERRIDE_SDMA0_MASK)));

            /* Make sure DEEP POWER DOWN reset is disabled */
            PMC->RESETCTRL = PMC->RESETCTRL & (~PMC_RESETCTRL_DPDWAKEUPRESETENABLE_MASK);

            /* Adjust BoD Core Trip point . Currently set to 700 mV. TODO :: :: Check this value. */
            reg_data        = PMC->BODCORE;
            bod_core_trglvl = (reg_data & PMC_BODCORE_TRIGLVL_MASK) >> PMC_BODCORE_TRIGLVL_SHIFT;
            PMC->BODCORE = (reg_data & (~PMC_BODCORE_TRIGLVL_MASK)) | PMC_BODCORE_TRIGLVL(kPOWER_BodCoreLevel0A700mv);

            // CSSV2
            {
                syscon_css_clk_ctrl = SYSCON_CSS_CLK_CTRL_REG & (1U << 1);

                css_ctrl = 0U;

#if (defined(LPC55S36_SERIES) || defined(LPC5536_SERIES) || defined(LPC5534_SERIES))
                syscon_css_clk_pclk_hclk = SYSCON->AHBCLKCTRL2 & (0x1UL << 18);
                /* Check if CSS is NOT in reset AND is clocked and enable, to avoid deadlock situations or a hardfault
                 */
                if ((0UL != (CSSV2_CTRL_REG & 0x1U)) && ((SYSCON->PRESETCTRL2 & 0x40000U) == 0UL) && (0UL != syscon_css_clk_pclk_hclk))
#else
                syscon_css_clk_pclk_hclk = SYSCON->AHBCLKCTRL[2] & (0x1UL<< 18);
                /* Check if CSS is NOT in reset AND is clocked and enable, to avoid deadlock situations or a hardfault
                 */
                if (((SYSCON->PRESETCTRL[2] & 0x40000U) == 0) && syscon_css_clk_pclk_hclk && (CSSV2_CTRL_REG & 0x1U))
#endif
                {
                    css_ctrl = CSSV2_CTRL_REG;

                    /* Wait until CSS is in idle state (CSS_STATUS_BUSY_MASK) */
                    while (0UL != (CSSV2_STATUS_REG & 0x1UL))
                    {
                    }

                    /* Disable CSS */
                    CSSV2_CTRL_REG = CSSV2_CTRL_REG & 0xFFFFFFFEU;

                    /* Swicth off i_css_clk/pclk/hclk */
                    SYSCON->AHBCLKCTRLCLR[2] = ((uint32_t)1U << 18);
                }

                /* Switch off DTRNG clocks */
                SYSCON_CSS_CLK_CTRL_CLR_REG = (1U << 1);
            }

            /* Disable all IRQs */
            __disable_irq();

            /*
             * - Switch PMC clock to 1 MHz,
             * - Set LDO_MEM as SRAM supply source during DEEP-SLEEP,
             * - Set LDO_CORE Low Power mode as Core supply source during DEEP-SLEEP,
             * - Select Core Logic supply source when waking up from DEEP-SLEEP.
             */
            reg_data = PMC->CTRL & (~PMC_CTRL_SELCLOCK_MASK) & (~PMC_CTRL_DEEPSLEEPCORESUPPLY_MASK) &
                       (~PMC_CTRL_SELMEMSUPPLY_MASK);
            if (POWER_GetCorePowerSource() == kPOWER_CoreSrcDCDC)
            {
                /* Core Logic is supplied by DCDC Converter when waking up from DEEP-SLEEP */
                PMC->CTRL = reg_data & (~PMC_CTRL_SELCORESUPPLYWK_MASK);
            }
            else
            {
                /* Core Logic is supplied by LDO CORE (configured in High Power mode) when waking up from DEEP-SLEEP */
                PMC->CTRL = reg_data | PMC_CTRL_SELCORESUPPLYWK_MASK;
            }

            /* _WFI() */
            POWER_PowerCycleCpu();

            /* Switch PMC clock to 12 MHz and Configure the PMC in ACTIVE mode */
            PMC->CTRL = (PMC->CTRL & (~PMC_CTRL_LPMODE_MASK)) | PMC_CTRL_SELCLOCK_MASK |
                        PMC_CTRL_LPMODE(LOWPOWER_CFG_LPMODE_ACTIVE);

            /* Restore BoD Core Trip point. */
            PMC->BODCORE = (PMC->BODCORE & (~PMC_BODCORE_TRIGLVL_MASK)) | PMC_BODCORE_TRIGLVL(bod_core_trglvl);

            // CSSV2
            {
                /* Restore i_css_clk/pclk/hclk */
                SYSCON->AHBCLKCTRLSET[2] = syscon_css_clk_pclk_hclk;

                /* Restore DTRNG clocks */
                SYSCON_CSS_CLK_CTRL_SET_REG = syscon_css_clk_ctrl;

/* Check if CSS is NOT in reset AND is clocked, to avoid deadlock situations */
#if (defined(LPC55S36_SERIES) || defined(LPC5536_SERIES) || defined(LPC5534_SERIES))
                if (((SYSCON->PRESETCTRL2 & 0x40000U) == 0UL) && (0UL != syscon_css_clk_pclk_hclk) && (0UL != (css_ctrl & 0x1UL)))
#else
                if (((SYSCON->PRESETCTRL[2] & 0x40000U) == 0UL) && (0UL != syscon_css_clk_pclk_hclk) && (0UL != (css_ctrl & 0x1UL)))
#endif
                {
                    /* Restore CSS */
                    CSSV2_CTRL_REG = css_ctrl;

                    /* Wait until CSS is in idle state */
                    while (0UL != (CSSV2_STATUS_REG & 0x1UL))
                    {
                    }
                }
            }

            /* Restore AUTOCLKGATEOVERRIDE register*/
            SYSCON->AUTOCLKGATEOVERRIDE = 0xC0DE0000UL | syscon_autoclkgateoverride_reg;

            /* Reset Sleep Postpone configuration */
            SYSCON->HARDWARESLEEP = 0;

            break;
        }

        case LOWPOWER_CFG_LPMODE_POWERDOWN:
        {
            uint32_t lpcac_ctrl_reg;
            uint32_t vref_rst_state;
            uint32_t vref_clk_state;
            uint32_t syscon_ahbclk_reg_0;
            uint32_t syscon_css_clk_ctrl, syscon_css_clk_pclk_hclk;

            /* POWER DOWN power mode */
            power_core_pwr_source_t core_supply_source;

