nxp-mcuxpresso/mcux-sdk/devices/LPC5536/drivers/fsl_power.c
        if (lv_ldo_core_signed < (int32_t)V_LDOCORE_HP_1P204)
        {
            lv_ldo_core = (uint32_t)V_LDOCORE_HP_1P204;
        }
        else
        {
            if (lv_ldo_core_signed > (int32_t)V_LDOCORE_HP_0P953)
            {
                lv_ldo_core = (uint32_t)V_LDOCORE_HP_0P953;
            }
            else
            {
                lv_ldo_core = (uint32_t)lv_ldo_core_signed;
            }
        }
    }
#endif
    PMC->LDOCORE0 = (PMC->LDOCORE0 & (~PMC_LDOCORE0_REGREFTRIM_MASK)) | PMC_LDOCORE0_REGREFTRIM(lv_ldo_core);
}

/**
 * brief
 * return
 */
static void POWER_SRAMSetRegister(power_sram_index_t sram_index, uint32_t power_mode)
{
    switch (sram_index)
    {
        case kPOWER_SRAM_IDX_RAM_X0:
        {
            PMC->SRAMCTRL0 = (PMC->SRAMCTRL0 & (~(0xFUL << PMC_SRAMCTRL0_RAM_X0_LS_SHIFT))) |
                             (power_mode << PMC_SRAMCTRL0_RAM_X0_LS_SHIFT);
            break;
        }

        case kPOWER_SRAM_IDX_RAM_00:
        {
            PMC->SRAMCTRL0 = (PMC->SRAMCTRL0 & (~(0xFUL << PMC_SRAMCTRL0_RAM_00_LS_SHIFT))) |
                             (power_mode << PMC_SRAMCTRL0_RAM_00_LS_SHIFT);
            break;
        }

        case kPOWER_SRAM_IDX_RAM_01:
        {
            PMC->SRAMCTRL0 = (PMC->SRAMCTRL0 & (~(0xFUL << PMC_SRAMCTRL0_RAM_01_LS_SHIFT))) |
                             (power_mode << PMC_SRAMCTRL0_RAM_01_LS_SHIFT);
            break;
        }

        case kPOWER_SRAM_IDX_RAM_02:
        {
            PMC->SRAMCTRL0 = (PMC->SRAMCTRL0 & (~(0xFUL << PMC_SRAMCTRL0_RAM_02_LS_SHIFT))) |
                             (power_mode << PMC_SRAMCTRL0_RAM_02_LS_SHIFT);
            break;
        }

        case kPOWER_SRAM_IDX_RAM_03:
        {
            PMC->SRAMCTRL0 = (PMC->SRAMCTRL0 & (~(0xFUL << PMC_SRAMCTRL0_RAM_03_LS_SHIFT))) |
                             (power_mode << PMC_SRAMCTRL0_RAM_03_LS_SHIFT);
            break;
        }

        case kPOWER_SRAM_IDX_RAM_10:
        {
            PMC->SRAMCTRL0 = (PMC->SRAMCTRL0 & (~(0xFUL << PMC_SRAMCTRL0_RAM_10_LS_SHIFT))) |
                             (power_mode << PMC_SRAMCTRL0_RAM_10_LS_SHIFT);
            break;
        }

        case kPOWER_SRAM_IDX_RAM_20:
        {
            PMC->SRAMCTRL0 = (PMC->SRAMCTRL0 & (~(0xFUL << PMC_SRAMCTRL0_RAM_20_LS_SHIFT))) |
                             (power_mode << PMC_SRAMCTRL0_RAM_20_LS_SHIFT);
            break;
        }

        case kPOWER_SRAM_IDX_RAM_30:
        {
            PMC->SRAMCTRL0 = (PMC->SRAMCTRL0 & (~(0xFUL << PMC_SRAMCTRL0_RAM_30_LS_SHIFT))) |
                             (power_mode << PMC_SRAMCTRL0_RAM_30_LS_SHIFT);
            break;
        }

        case kPOWER_SRAM_IDX_RAM_40:
        {
            PMC->SRAMCTRL1 = (PMC->SRAMCTRL1 & (~(0xFUL << PMC_SRAMCTRL1_RAM_40_LS_SHIFT))) |
                             (power_mode << PMC_SRAMCTRL1_RAM_40_LS_SHIFT);
            break;
        }

        case kPOWER_SRAM_IDX_RAM_41:
        {
            PMC->SRAMCTRL1 = (PMC->SRAMCTRL1 & (~(0xFUL << PMC_SRAMCTRL1_RAM_41_LS_SHIFT))) |
                             (power_mode << PMC_SRAMCTRL1_RAM_41_LS_SHIFT);
            break;
        }

        case kPOWER_SRAM_IDX_RAM_42:
        {
            PMC->SRAMCTRL1 = (PMC->SRAMCTRL1 & (~(0xFUL << PMC_SRAMCTRL1_RAM_42_LS_SHIFT))) |
                             (power_mode << PMC_SRAMCTRL1_RAM_42_LS_SHIFT);
            break;
        }

        case kPOWER_SRAM_IDX_RAM_43:
        {
            PMC->SRAMCTRL1 = (PMC->SRAMCTRL1 & (~(0xFUL << PMC_SRAMCTRL1_RAM_43_LS_SHIFT))) |
                             (power_mode << PMC_SRAMCTRL1_RAM_43_LS_SHIFT);
            break;
        }

        case kPOWER_SRAM_IDX_FLASHCACHE:
        {
            PMC->SRAMCTRL1 = (PMC->SRAMCTRL1 & (~(0xFUL << PMC_SRAMCTRL1_RAM_FLASHLPCACHE_LS_SHIFT))) |
                             (power_mode << PMC_SRAMCTRL1_RAM_FLASHLPCACHE_LS_SHIFT);
            break;
        }

        case kPOWER_SRAM_IDX_FLEXSPICACHE:
        {
            PMC->SRAMCTRL1 = (PMC->SRAMCTRL1 & (~(0xFUL << PMC_SRAMCTRL1_RAM_FLEXSPILPCACHE_LS_SHIFT))) |
                             (power_mode << PMC_SRAMCTRL1_RAM_FLEXSPILPCACHE_LS_SHIFT);
            break;
        }

        default:
            // Error
            break;
    }
}

/**
 * brief
 * return
 */
static void POWER_SRAMActiveToLightSleep(power_sram_index_t sram_index)
{
    POWER_SRAMSetRegister(sram_index, SRAM_PWR_MODE_LS_CODE);
}

/**
 * brief
 * return
 */
static void POWER_SRAMActiveToDeepSleep(power_sram_index_t sram_index)
{
    POWER_SRAMSetRegister(sram_index, SRAM_PWR_MODE_DS_CODE);
}

/**
 * brief
 * return
 */
static void POWER_SRAMActiveToShutDown(power_sram_index_t sram_index)
{
    POWER_SRAMSetRegister(sram_index, SRAM_PWR_MODE_SD_CODE);
}

/**
 * brief
 * return
 */
static void POWER_SRAMLightSleepToActive(power_sram_index_t sram_index)
{
    POWER_SRAMSetRegister(sram_index, SRAM_PWR_MODE_MPU_CODE);
    // Wait at least 944.90 ns (worst case, from gf40rfnv_nxp_ehlvsram_008192x032bw4c04_mh_pt_m7)
    POWER_SRAMPowerUpDelay(); // wait about 1 us
    POWER_SRAMSetRegister(sram_index, SRAM_PWR_MODE_ACT_CODE);
}

/**
 * brief
 * return
 */
static void POWER_SRAMDeepSleepToActive(power_sram_index_t sram_index)
{
    POWER_SRAMSetRegister(sram_index, SRAM_PWR_MODE_FPU_CODE);
    // Wait at least 707.30 ns (worst case, from gf40rfnv_nxp_ehlvsram_008192x032bw4c04_mh_pt_m7)
    POWER_SRAMPowerUpDelay(); // wait about 1 us
    POWER_SRAMSetRegister(sram_index, SRAM_PWR_MODE_ACT_CODE);
}

/**
 * brief
 * return
 */
static void POWER_SRAMShutDownToActive(power_sram_index_t sram_index)
{
    POWER_SRAMSetRegister(sram_index, SRAM_PWR_MODE_FPU_CODE);
    // Wait at least 382.80 ns (worst case, from gf40rfnv_nxp_ehlvsram_008192x032bw4c04_mh_pt_m7)
    POWER_SRAMPowerUpDelay(); // wait about 1 us
    POWER_SRAMSetRegister(sram_index, SRAM_PWR_MODE_ACT_CODE);
}

/**
 * brief
 * return
 */
static void POWER_SetSystemClock12MHZ(void)
{
    if ((SYSCON->MAINCLKSELA != 0UL) || (SYSCON->MAINCLKSELB != 0UL) ||
        ((SYSCON->AHBCLKDIV & SYSCON_AHBCLKDIV_DIV_MASK) != 0UL))
    {
        /* The System is NOT running at 12 MHz: so switch the system on 12 MHz clock */
        /* IMPORTANT NOTE : The assumption here is that before calling any Low Power API
         * the system will be running at a frequency higher or equal to 12 MHz.
         */
        uint32_t flash_int_enable_reg;
        uint32_t num_wait_states = 1; /* Default to the maximum number of wait states */

        /* Switch main clock to FRO12MHz ( the order of the 5 settings below is critical) */
        SYSCON->MAINCLKSELA = SYSCON_MAINCLKSELA_SEL(0); /* Main clock A source select : FRO 12 MHz clock */
        SYSCON->MAINCLKSELB = SYSCON_MAINCLKSELB_SEL(0); /* Main clock B source select : Main Clock A */
        SYSCON->AHBCLKDIV   = SYSCON_AHBCLKDIV_DIV(0);   /* Main clock divided by 1 */

