nxp-mcuxpresso/mcux-sdk/devices/LPC5536/drivers/fsl_power.c
/* Adjust FMC waiting time cycles (num_wait_states) and disable PREFETCH
 * NOTE : PREFETCH disable MUST BE DONE BEFORE the flash command below.
 */
#if (defined(LPC55S36_SERIES) || defined(LPC5536_SERIES) || defined(LPC5534_SERIES))
        SYSCON->FMCCR = (SYSCON->FMCCR & (~SYSCON_FMCCR_FLASHTIM_MASK) & (~SYSCON_FMCCR_PREFEN_MASK)) |
                        SYSCON_FMCCR_FLASHTIM(num_wait_states);
        /* Adjust Flash Controller waiting time */
        flash_int_enable_reg = FLASH->INTEN; /* Save INT_ENABLE register. */
        FLASH->INTEN_CLR     = 0x1F;         /* Disable all interrupt */
        FLASH->INTSTAT_CLR   = 0x1F;         /* Clear all status flags */
#else
        SYSCON->FMCCR = (SYSCON->FMCCR & (~SYSCON_FMCCR_FMCTIM_MASK) & (~SYSCON_FMCCR_PREFEN_MASK)) |
                        SYSCON_FMCCR_FMCTIM(num_wait_states);
        /* Adjust Flash Controller waiting time */
        flash_int_enable_reg = FLASH->INT_ENABLE; /* Save INT_ENABLE register. */
        FLASH->INT_CLR_ENABLE = 0x1F;             /* Disable all interrupt */
        FLASH->INT_CLR_STATUS = 0x1F;             /* Clear all status flags */
#endif

        FLASH->DATAW[0] = num_wait_states;
        FLASH->CMD      = 0x2; /* CMD_SET_READ_MODE */

#if (defined(LPC55S36_SERIES) || defined(LPC5536_SERIES) || defined(LPC5534_SERIES))
        /* Wait until the cmd is completed (without error) */
        while (0UL == (FLASH->INTSTAT & FLASH_INTSTAT_DONE_MASK))
        {
        }
        FLASH->INTSTAT_CLR = 0x1F;                 /* Clear all status flags, then ... */
        FLASH->INTEN_SET   = flash_int_enable_reg; /* ... restore INT_ENABLE register. */
#else
        /* Wait until the cmd is completed (without error) */
        while (!(FLASH->INT_STATUS & FLASH_INT_STATUS_DONE_MASK))
        {
        }
        FLASH->INT_CLR_STATUS = 0x1F;                 /* Clear all status flags, then ... */
        FLASH->INT_SET_ENABLE = flash_int_enable_reg; /* ... restore INT_ENABLE register. */
#endif

        POWER_SetSystemPowerProfile(
            V_SYSTEM_POWER_PROFILE_LOW); /* Align DCDC/LDO_CORE Power profile with the 12 MHz frequency */
    }
    else
    {
        /* The System is already running at 12 MHz: so disable FMC PREFETCH feature only */
        SYSCON->FMCCR = SYSCON->FMCCR & (~SYSCON_FMCCR_PREFEN_MASK);
    }
}
